system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-20.6 0 -0.5) // 0
    (-20.6 25.4 -0.5) // 1
    (0 -25.4 -0.5) // 2
    (0 0 -0.5) // 3
    (0 25.4 -0.5) // 4
    (206 -25.4 -0.5) // 5
    (206 0 -0.5) // 6
    (206 25.4 -0.5) // 7
    (290 -16.6 -0.5) // 8
    (290 0 -0.5) // 9
    (290 16.6 -0.5) // 10

    (-20.6 0 0.5) // 11
    (-20.6 25.4 0.5) // 12
    (0 -25.4 0.5) // 13
    (0 0 0.5) // 14
    (0 25.4 0.5) // 15
    (206 -25.4 0.5) // 16
    (206 0 0.5) // 17
    (206 25.4 0.5) // 18
    (290 -16.6 0.5) // 19 
    (290 0 0.5) // 20 
    (290 16.6 0.5) // 21
);

negY
(
    // 2.0/3.0 and 1.0/3.0 % of division
    // 4.0/7.0 and 3.0/7.0 % of cells
    // 1 and 0.3 expansion
    (2 4 1)
    (1 3 0.3)
);

posY
(
    // 1.0/5.0, 2.0/5.0 and 2.0/5.0 % of division
    // 4.0/10.0, 3.0/10.0 and 4.0/10.0 % of cells
    // 2, 4 and 0.25 expansion
    (1 4 2)
    (2 3 4)
    (2 4 0.25)
);

posYR
(   
    // 2.0/3.0 and 1.0/3.0 % of division
    // 1.0/2.0 and 1.0/2.0 % of cells
    // 1 and 0.25 expansion
    (2 1 1)
    (1 1 0.25)
);


blocks
(
     // Inlet x[-20.6 , 0.0] and y[0, 25.4]
    hex (0 3 4 1 11 14 15 12)
    (18 30 1)
    simpleGrading (0.5 $posY 1)

    // Lower Wall from x[0.0, 206.0] and y[-25.4, 0.0]
    hex (2 5 6 3 13 16 17 14)
    (180 27 1)
    edgeGrading (4 4 4 4 $negY 1 1 $negY 1 1 1 1)

    // Upper Wall from x[0.0, 206.0] and y[0.0, 25.4]
    hex (3 6 7 4 14 17 18 15)
    (180 30 1)
    edgeGrading (4 4 4 4 $posY $posYR $posYR $posY 1 1 1 1)

    // Lower Outlet from x[206.0, 300.0] and y[-25.4, 0.0]
    hex (5 8 9 6 16 19 20 17)
    (25 27 1)
    simpleGrading (2.5 1 1)

    // Upper Outler from x[206.0, 300.0] and y[0.0, 25.4]
    hex (6 9 10 7 17 20 21 18)
    (25 30 1)
    simpleGrading (2.5 $posYR 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 12 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 20 19)
            (9 10 21 20)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (1 4 15 12)
            (4 7 18 15)
            (7 10 21 18)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 14 11)
            (3 2 13 14)
            (2 5 16 13)
            (5 8 19 16)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (2 5 6 3)
            (3 6 7 4)
            (5 8 9 6)
            (6 9 10 7)
            (11 14 15 12)
            (13 16 17 14)
            (14 17 18 15)
            (16 19 20 17)
            (17 20 21 18)
        );
    }
);

// ************************************************************************* //
