system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         none;
    grad(U)         cellLimited Gauss linear 1;
    curl(U)         cellLimited Gauss linear 1;
    grad(p)         cellLimited Gauss linear 1;
    grad(epsilon)   cellLimited Gauss linear 1;
    grad(k)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    div(phi,k)      bounded Gauss linearUpwind grad(k);
    div(phi,epsilon) bounded Gauss linearUpwind grad(epsilon);

    /*
    div(phi,omega)  bounded Gauss upwind;
    div(phi,v2)     bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(nonlinearStress) Gauss linear;
    */

    /*
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    div(phi,U)      bounded Gauss linearUpwind limited; // Most stable option
    div(phi,U)      bounded Gauss linearUpwind unlimited;
    div(phi,U)      bounded Gauss linearUpwindV grad(U);
    div(phi,U)      bounded Gauss linearUpwindV limited;
    */
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.5;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.5;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
